Autodesk.Revit.DB.Structure.RebarBarType.SetAutoCalculatedStaggerLength(Autodesk.Revit.DB.ElementId,System.Boolean)
Sets if the stagger length is auto calculated or not for the specified Rebar Splice Type.
Remarks:
If it is auto calculated, stagger length value is computed based on the formula: stagger length multiplier (found in splice type) * lap length.
rebarSpliceTypeId:
The Rebar Splice Type id.
Interactions with Rebar Splice Types can be done with the functions in Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.
autoCalculated:
True, if the stagger length is auto calculated, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBarType.GetAutoCalculatedStaggerLength(Autodesk.Revit.DB.ElementId)
Identifies if the stagger length is auto calculated for the specified Rebar Splice Type.
Remarks:
If it is auto calculated, stagger length value is computed based on the formula: stagger length multiplier (found in splice type) * lap length.
rebarSpliceTypeId:
The Rebar Splice Type id.
Interactions with Rebar Splice Types can be done with the functions in Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.
Returns:
Returns true if the stagger length is auto calculated for the specified rebar bar type and Rebar Splice Type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBarType.SetStaggerLength(Autodesk.Revit.DB.ElementId,System.Double)
Sets the stagger length for the specified Rebar Splice Type.
rebarSpliceTypeId:
The Rebar Splice Type id.
Interactions with Rebar Splice Types can be done with the functions in Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.
staggerLength:
The new value of the stagger length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
-or-
For the specified Rebar Splice Type the stagger length is auto calculated and the stagger length cannot be manually set.
Its value is computed based on the formula splice type: stagger length multiplier * bar nominal diameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBarType.GetStaggerLength(Autodesk.Revit.DB.ElementId)
Gets the stagger length taking into account the specified Rebar Splice Type.
rebarSpliceTypeId:
The Rebar Splice Type id.
Interactions with Rebar Splice Types can be done with the functions in Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.
Returns:
Returns the stagger length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBarType.SetAutoCalculatedLapLength(Autodesk.Revit.DB.ElementId,System.Boolean)
Sets if the lap length is auto calculated or not for the specified Rebar Splice Type.
Remarks:
If it is auto calculated, lap length value is computed based on the formula: lap length multiplier (found in splice type) * bar nominal diameter.
rebarSpliceTypeId:
The Rebar Splice Type id.
Interactions with Rebar Splice Types can be done with the functions in Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.
autoCalculated:
True, if the lap length is auto calculated, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBarType.GetAutoCalculatedLapLength(Autodesk.Revit.DB.ElementId)
Identifies if the lap length is auto calculated for the specified Rebar Splice Type.
Remarks:
If it is auto calculated, lap length value is computed based on the formula: lap length multiplier (found in splice type) * bar nominal diameter.
rebarSpliceTypeId:
The Rebar Splice Type id.
Interactions with Rebar Splice Types can be done with the functions in Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.
Returns:
Returns true if the lap length is auto calculated for the specified rebar bar type and Rebar Splice Type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBarType.SetLapLength(Autodesk.Revit.DB.ElementId,System.Double)
Sets the lap length for the specified Rebar Splice Type.
rebarSpliceTypeId:
The Rebar Splice Type id.
Interactions with Rebar Splice Types can be done with the functions in Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.
lapLength:
The new value of the lap length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
-or-
For the specified Rebar Splice Type the lap length is auto calculated and the lap length cannot be manually set.
Its value is computed based on the formula splice type: lap length multiplier * bar nominal diameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBarType.GetLapLength(Autodesk.Revit.DB.ElementId)
Gets the lap length taking into account the specified Rebar Splice Type.
rebarSpliceTypeId:
The Rebar Splice Type id.
Interactions with Rebar Splice Types can be done with the functions in Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils.
Returns:
Returns the lap length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025